# XYZ Constructor (Double, Double, Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ Constructor (Double, Double, Double)
XYZ Class See Also
---
Creates an XYZ with the supplied coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ(
	double x,
	double y,
	double z
)
```

Visual Basic
---
```text
Public Sub New ( _
	x As Double, _
	y As Double, _
	z As Double _
)
```

Visual C++
---
```text
public:
XYZ(
	double x,
	double y,
	double z
)
```

# ### Parameters
x
    Type: System..::..DoubleThe first coordinate.
y
    Type: System..::..DoubleThe second coordinate.
z
    Type: System..::..DoubleThe third coordinate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting an infinite number to the X, Y or Z property. |

# See Also
XYZ Class
XYZ Overload
Autodesk.Revit.DB Namespace